TEST1/meshConvergenceStudy/cases/coarse/0/Te
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Te;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    left     { type symmetryPlane; }
    right    { type symmetryPlane; }
    front    { type symmetryPlane; }
    back     { type symmetryPlane; }

    // BOTTOM - substrate (receiver) - strong heat sink
    substrate
    {
        type            fixedValue;
        value           uniform 300;  // Heat sink effect
    }
    
    // TOP - donor (transparent glass) - now treated as open boundary
    donor
    {
        type            zeroGradient;
    }
}

// REASONING:
// - Substrate (bottom): Strong heat sink - removes excess energy
// - Donor (top): Glass substrate - minimal thermal interference
// - This allows proper temperature buildup in metal film
// - Prevents over-cooling from both sides


// ************************************************************************* //
