TEST1/meshConvergenceStudy/cases/coarse/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1    # Run from this directory

# Source OpenFOAM environment
if [ -f "/opt/openfoam/etc/bashrc" ]; then
    . /opt/openfoam/etc/bashrc
else
    echo "ERROR: OpenFOAM environment not found"
    exit 1
fi

echo "Running mesh convergence study - TEST1 - coarse"
echo "=================================================="
echo ""

# Clean previous results
echo "Cleaning previous results..."
./Allclean

# Generate mesh
echo "Generating mesh..."
blockMesh > log.blockMesh 2>&1
if [ $? -ne 0 ]; then
    echo "ERROR: blockMesh failed! Check log.blockMesh"
    exit 1
fi
echo "Mesh generated successfully"
echo ""

# Check mesh
echo "Checking mesh quality..."
checkMesh > log.checkMesh 2>&1
if [ $? -ne 0 ]; then
    echo "WARNING: checkMesh reported issues. Check log.checkMesh"
fi
echo ""

# Run solver
echo "Running compInterFoam..."
echo "This may take several hours depending on mesh size and hardware..."
echo "Monitor progress with: tail -f log.compInterFoam"
echo ""
compInterFoam > log.compInterFoam 2>&1
if [ $? -ne 0 ]; then
    echo "ERROR: compInterFoam failed! Check log.compInterFoam"
    exit 1
fi

echo ""
echo "Simulation completed successfully!"
echo "Results available in time directories"
echo "=================================================="
